export default {
    "response": {
      "count": 107163,
      "items": [
        {
          "id": 1246928,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1571844664,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Вниманию мастеров айтишного слова!\n\nХабр вновь запускает конкурс статей «ТехноТекст». К участию мы приглашаем технических авторов с рассказами о разработке, успешных (и не очень) кейсах, интервью с экспертами, обзорами гаджетов и прочими выраженными в текстовой форме IT-историями, которые были опубликованы на Хабре или любой блоговой платформе, корпоративном сайте или в СМИ.\n\nНоминации уже поддержали Сбербанк, Яндекс.Практикум, Онтико и RuVDS.\n\nПодробности 👉 http://amp.gs/q7cl",
          "is_pinned": 1,
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457271897,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun9-19.userapi.com/c635101/v635101441/474ee/YH98b4CqpyE.jpg",
                "photo_130": "https://sun9-36.userapi.com/c635101/v635101441/474ef/WCDTJL_3l1s.jpg",
                "photo_604": "https://sun9-21.userapi.com/c635101/v635101441/474f0/NQianomaJ7A.jpg",
                "photo_807": "https://sun9-57.userapi.com/c635101/v635101441/474f1/7wjESGZf_bc.jpg",
                "photo_1280": "https://sun9-27.userapi.com/c635101/v635101441/474f2/O-XbzooQ8Uk.jpg",
                "width": 1119,
                "height": 595,
                "text": "Вниманию мастеров айтишного слова!\n\nХабр вновь запускает конкурс статей «ТехноТекст». К участию мы приглашаем технических авторов с рассказами о разработке, успешных (и не очень) кейсах, интервью с экспертами, обзорами гаджетов и прочими выраженными в текстовой форме IT-историями, которые были опубликованы на Хабре или любой блоговой платформе, корпоративном сайте или в СМИ.\n\nНоминации уже поддержали Сбербанк, Яндекс.Практикум, Онтико и RuVDS.\n\nПодробности 👉 http://amp.gs/q7cl",
                "date": 1571844664,
                "post_id": 1246928,
                "access_key": "9e1b94d37d8e13b6bb"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 3,
            "can_post": 1
          },
          "likes": {
            "count": 33,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 5,
            "user_reposted": 0
          },
          "views": {
            "count": 32020
          }
        },
        {
          "id": 1247831,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572255960,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "«Этот тест состоит из трёх стандартных частей, которые называются настройка, действие и проверка. Всё выглядит как бы хорошо. Но что происходит, когда кто-то добавит дополнительный шаг в этот тест?»\n\nSpecFlowMaster — как улучшить качество тестов: http://amp.gs/qUxK\n\n#разработка@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272058,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-28.userapi.com/c635101/v635101397/46c04/GmCC_PU4O-I.jpg",
                "photo_130": "https://sun1-16.userapi.com/c635101/v635101397/46c05/k03ojiC3tFk.jpg",
                "photo_604": "https://sun1-15.userapi.com/c635101/v635101397/46c06/ia1aK8mnw4o.jpg",
                "width": 532,
                "height": 278,
                "text": "«Этот тест состоит из трёх стандартных частей, которые называются настройка, действие и проверка. Всё выглядит как бы хорошо. Но что происходит, когда кто-то добавит дополнительный шаг в этот тест?»\n\nSpecFlowMaster — как улучшить качество тестов: http://amp.gs/qUxK\n\n#разработка@habr",
                "date": 1572255960,
                "post_id": 1247831,
                "access_key": "eb680123c93afcaec3"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 0,
            "can_post": 1
          },
          "likes": {
            "count": 9,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 0,
            "user_reposted": 0
          },
          "views": {
            "count": 6168
          }
        },
        {
          "id": 1247828,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572255062,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Работа в IT, управление проектами, регулирование ПД и разработка в облаке: мегадайджест от 1cloud.\n\nЗдесь вы найдёте материалы об истории Linux, обсуждение стоп-фраз для PM'ов и зарплат разработчиков плюс — большую фотоэкскурсию по нашему облаку: http://amp.gs/qUnl\n\n#разработка@habr #администрирование@habr #управление@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272057,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-18.userapi.com/c635101/v635101397/46be7/bsn0OsNmOEM.jpg",
                "photo_130": "https://sun1-22.userapi.com/c635101/v635101397/46be8/9LEj-9CtR2s.jpg",
                "photo_604": "https://sun1-24.userapi.com/c635101/v635101397/46be9/EjxXasoGwFg.jpg",
                "photo_807": "https://sun1-24.userapi.com/c635101/v635101397/46bea/t1JcGKA58lc.jpg",
                "photo_1280": "https://sun1-85.userapi.com/c635101/v635101397/46beb/aKc0uaN0q-g.jpg",
                "width": 1000,
                "height": 556,
                "text": "Работа в IT, управление проектами, регулирование ПД и разработка в облаке: мегадайджест от 1cloud.\n\nЗдесь вы найдёте материалы об истории Linux, обсуждение стоп-фраз для PM'ов и зарплат разработчиков плюс — большую фотоэкскурсию по нашему облаку: http://amp.gs/qUnl\n\n#разработка@habr #администрирование@habr #управление@habr",
                "date": 1572255062,
                "post_id": 1247828,
                "access_key": "a72aa3f8e4858a1115"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 0,
            "can_post": 1
          },
          "likes": {
            "count": 2,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 0,
            "user_reposted": 0
          },
          "views": {
            "count": 8560
          }
        },
        {
          "id": 1247825,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572254116,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "«Иногда баллы в приложениях не так важны, как, например, создание полезного или интересного опыта для клиента».\n\nPR в digital-эпоху, современные программы лояльности и фестивальный маркетинг: http://amp.gs/qUpH\n\n#управление@habr #маркетинг@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272056,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-30.userapi.com/c635101/v635101397/46bde/8jL9yD8MLts.jpg",
                "photo_130": "https://sun1-87.userapi.com/c635101/v635101397/46bdf/T7KwwBLvDkY.jpg",
                "photo_604": "https://sun1-84.userapi.com/c635101/v635101397/46be0/L95lUkXTHLI.jpg",
                "photo_807": "https://sun1-91.userapi.com/c635101/v635101397/46be1/JjS6VINnKd8.jpg",
                "photo_1280": "https://sun1-19.userapi.com/c635101/v635101397/46be2/rPNEamTnEus.jpg",
                "width": 1280,
                "height": 720,
                "text": "«Иногда баллы в приложениях не так важны, как, например, создание полезного или интересного опыта для клиента».\n\nPR в digital-эпоху, современные программы лояльности и фестивальный маркетинг: http://amp.gs/qUpH\n\n#управление@habr #маркетинг@habr",
                "date": 1572254116,
                "post_id": 1247825,
                "access_key": "cf5d01fc2fcfeaeecf"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 0,
            "can_post": 1
          },
          "likes": {
            "count": 8,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 0,
            "user_reposted": 0
          },
          "views": {
            "count": 10385
          }
        },
        {
          "id": 1247824,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572253230,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Проекты Arduino DIY: роботизированный тир «Демоническая карусель».\n\n«Я существенно доработал эту модель, и хотя устройство находится пока в нерабочем состоянии (предстоит ещё писать программу), мне всё же есть что показать и рассказать вам»: http://amp.gs/qUY3\n\n#разработка@habr #гиктаймс@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272055,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-18.userapi.com/c635101/v635101397/46bd6/kuDEozl02qE.jpg",
                "photo_130": "https://sun1-30.userapi.com/c635101/v635101397/46bd7/EuEBJtvWBFM.jpg",
                "photo_604": "https://sun1-28.userapi.com/c635101/v635101397/46bd8/2lMW4MgeI5k.jpg",
                "photo_807": "https://sun1-23.userapi.com/c635101/v635101397/46bd9/NIfGgpq0fnQ.jpg",
                "width": 800,
                "height": 473,
                "text": "Проекты Arduino DIY: роботизированный тир «Демоническая карусель».\n\n«Я существенно доработал эту модель, и хотя устройство находится пока в нерабочем состоянии (предстоит ещё писать программу), мне всё же есть что показать и рассказать вам»: http://amp.gs/qUY3\n\n#разработка@habr #гиктаймс@habr",
                "date": 1572253230,
                "post_id": 1247824,
                "access_key": "0df34c3db59e0e4a4c"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 3,
            "can_post": 1
          },
          "likes": {
            "count": 11,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 0,
            "user_reposted": 0
          },
          "views": {
            "count": 11088
          }
        },
        {
          "id": 1247820,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572251466,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Julia: с чего начать проект.\n\nПоговорим о такой важной теме, как создание с проекта с нуля на языке Julia, как его наполнить и какие технологические инструменты существуют для поддержки разработки: http://amp.gs/qUjJ\n\n#разработка@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272054,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-20.userapi.com/c635101/v635101017/42946/xtSNJHKKw5M.jpg",
                "photo_130": "https://sun1-90.userapi.com/c635101/v635101017/42947/cIUmFMkj0GY.jpg",
                "photo_604": "https://sun1-83.userapi.com/c635101/v635101017/42948/AhVX6ouHdps.jpg",
                "photo_807": "https://sun1-86.userapi.com/c635101/v635101017/42949/9sf_Ua6Rm64.jpg",
                "width": 800,
                "height": 455,
                "text": "Julia: с чего начать проект.\n\nПоговорим о такой важной теме, как создание с проекта с нуля на языке Julia, как его наполнить и какие технологические инструменты существуют для поддержки разработки: http://amp.gs/qUjJ\n\n#разработка@habr",
                "date": 1572251466,
                "post_id": 1247820,
                "access_key": "b0aae9bb3e7c9158ed"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 2,
            "can_post": 1
          },
          "likes": {
            "count": 23,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 1,
            "user_reposted": 0
          },
          "views": {
            "count": 14115
          }
        },
        {
          "id": 1247812,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572249660,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Менеджмент памяти, или Как реже стрелять себе в ногу.\n\n«В этой статье я попытаюсь рассказать, что из себя представляет менеджмент памяти в программах/приложениях с точки зрения прикладного программиста»: http://amp.gs/qRQG\n\n#разработка@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272052,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-88.userapi.com/c635101/v635101017/4293d/mhZJ_8arfUk.jpg",
                "photo_130": "https://sun1-18.userapi.com/c635101/v635101017/4293e/1brwwcuJ32s.jpg",
                "photo_604": "https://sun1-89.userapi.com/c635101/v635101017/4293f/d_AKdn6QmWk.jpg",
                "photo_807": "https://sun1-89.userapi.com/c635101/v635101017/42940/kgfbvyzyePA.jpg",
                "photo_1280": "https://sun1-17.userapi.com/c635101/v635101017/42941/HTiQJQ7H7qU.jpg",
                "width": 1024,
                "height": 576,
                "text": "Менеджмент памяти, или Как реже стрелять себе в ногу.\n\n«В этой статье я попытаюсь рассказать, что из себя представляет менеджмент памяти в программах/приложениях с точки зрения прикладного программиста»: http://amp.gs/qRQG\n\n#разработка@habr",
                "date": 1572249660,
                "post_id": 1247812,
                "access_key": "768215b6841d017073"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 3,
            "can_post": 1
          },
          "likes": {
            "count": 40,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 4,
            "user_reposted": 0
          },
          "views": {
            "count": 15977
          }
        },
        {
          "id": 1247805,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572247871,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Как закалялись бойцы Рунета: немного реальной истории.\n\nПо сути — ряд неизвестных историй периода становления IT в РФ, смешных и не очень, плюс описание типичной на тот момент карьеры: http://amp.gs/qRLC\n\n#управление@habr #гиктаймс@habr #разное@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272050,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-24.userapi.com/c635101/v635101310/51f05/edf1S0dvEyw.jpg",
                "photo_130": "https://sun1-14.userapi.com/c635101/v635101310/51f06/EkBUfv8ACTA.jpg",
                "photo_604": "https://sun1-90.userapi.com/c635101/v635101310/51f07/1rpHQ9OgsBo.jpg",
                "photo_807": "https://sun1-27.userapi.com/c635101/v635101310/51f08/yu1XNahywVA.jpg",
                "photo_1280": "https://sun1-90.userapi.com/c635101/v635101310/51f09/V0ExkPTah2Q.jpg",
                "width": 854,
                "height": 614,
                "text": "Как закалялись бойцы Рунета: немного реальной истории.\n\nПо сути — ряд неизвестных историй периода становления IT в РФ, смешных и не очень, плюс описание типичной на тот момент карьеры: http://amp.gs/qRLC\n\n#управление@habr #гиктаймс@habr #разное@habr",
                "date": 1572247871,
                "post_id": 1247805,
                "access_key": "cc55a8723b71bdeeeb"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 2,
            "can_post": 1
          },
          "likes": {
            "count": 38,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 4,
            "user_reposted": 0
          },
          "views": {
            "count": 17212
          }
        },
        {
          "id": 1247799,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572246047,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Главные IT-новости к этому часу.\n\nОригинальный и полностью рабочий компьютер Apple I выпуска 1976 года впервые продают на eBay: http://amp.gs/qR3K\n\nGoogle заменит все умные колонки Home и Mini, окирпиченные после последнего обновления, даже те, что были не на гарантии: http://amp.gs/qR33\n\nFacebook презентовала систему ИИ, которая может обмануть искусственный интеллект на видео: http://amp.gs/qR3H\n\nФСБ сможет отключать связь со странами, из которых звонят «телефонные террористы»: http://amp.gs/qR32\n\n#новости@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272047,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-14.userapi.com/c635101/v635101310/51efb/j7FTx0jO-YA.jpg",
                "photo_130": "https://sun1-23.userapi.com/c635101/v635101310/51efc/ZMIH8G8glag.jpg",
                "photo_604": "https://sun1-14.userapi.com/c635101/v635101310/51efd/SODIx3e1iFI.jpg",
                "photo_807": "https://sun1-23.userapi.com/c635101/v635101310/51efe/XHbiBrXF40k.jpg",
                "photo_1280": "https://sun1-86.userapi.com/c635101/v635101310/51eff/PoLpLxW1v9A.jpg",
                "photo_2560": "https://sun1-88.userapi.com/c635101/v635101310/51f00/Keoo3PU70W4.jpg",
                "width": 1555,
                "height": 944,
                "text": "Главные IT-новости к этому часу.\n\nОригинальный и полностью рабочий компьютер Apple I выпуска 1976 года впервые продают на eBay: http://amp.gs/qR3K\n\nGoogle заменит все умные колонки Home и Mini, окирпиченные после последнего обновления, даже те, что были не на гарантии: http://amp.gs/qR33\n\nFacebook презентовала систему ИИ, которая может обмануть искусственный интеллект на видео: http://amp.gs/qR3H\n\nФСБ сможет отключать связь со странами, из которых звонят «телефонные террористы»: http://amp.gs/qR32\n\n#новости@habr",
                "date": 1572246047,
                "post_id": 1247799,
                "access_key": "cce58bd2d7781c60ac"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 0,
            "can_post": 1
          },
          "likes": {
            "count": 14,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 0,
            "user_reposted": 0
          },
          "views": {
            "count": 17181
          }
        },
        {
          "id": 1247794,
          "from_id": -20629724,
          "owner_id": -20629724,
          "date": 1572244264,
          "marked_as_ads": 0,
          "post_type": "post",
          "text": "Почему негативное восприятие учебного процесса связывают с его положительными результатами.\n\nМетоды преподавания тоже должны нравиться, а учебный процесс обязан вызывать исключительно положительные эмоции. Это верно. Но, как выяснили учёные, не всегда: http://amp.gs/qRu4\n\n#гиктаймс@habr",
          "attachments": [
            {
              "type": "photo",
              "photo": {
                "id": 457272046,
                "album_id": -7,
                "owner_id": -20629724,
                "user_id": 100,
                "photo_75": "https://sun1-25.userapi.com/c635101/v635101697/4f3b0/jPYNDZ2WUgg.jpg",
                "photo_130": "https://sun1-30.userapi.com/c635101/v635101697/4f3b1/ytnrtPXKXlI.jpg",
                "photo_604": "https://sun1-84.userapi.com/c635101/v635101697/4f3b2/yV1zFCJTDIE.jpg",
                "photo_807": "https://sun1-16.userapi.com/c635101/v635101697/4f3b3/9UMC8xxuNuw.jpg",
                "photo_1280": "https://sun1-26.userapi.com/c635101/v635101697/4f3b4/wVGnF9DXWE0.jpg",
                "photo_2560": "https://sun1-91.userapi.com/c635101/v635101697/4f3b5/FLzHcx4MKtc.jpg",
                "width": 2000,
                "height": 1333,
                "text": "Почему негативное восприятие учебного процесса связывают с его положительными результатами.\n\nМетоды преподавания тоже должны нравиться, а учебный процесс обязан вызывать исключительно положительные эмоции. Это верно. Но, как выяснили учёные, не всегда: http://amp.gs/qRu4\n\n#гиктаймс@habr",
                "date": 1572244264,
                "post_id": 1247794,
                "access_key": "e81e8f45b1538fd7c0"
              }
            }
          ],
          "post_source": {
            "type": "api"
          },
          "comments": {
            "count": 6,
            "can_post": 1
          },
          "likes": {
            "count": 100,
            "user_likes": 0,
            "can_like": 1,
            "can_publish": 1
          },
          "reposts": {
            "count": 7,
            "user_reposted": 0
          },
          "views": {
            "count": 24089
          }
        }
      ]
    }
  }